src/AccumulationRegisters/Сертификаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Сертификаты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Клиент владелец сертификата</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/Сертификаты/Ext/RecordSetModule.bsl
#Область ОбработчикиСобытий

// Процедура - обработчик события ПередЗаписью набора записей.
//
&НаСервере
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Установка исключительной блокировки текущего набора записей регистратора.
	Блокировка              = Новый БлокировкаДанных;
	ЭлементБлокировки       = Блокировка.Добавить("РегистрНакопления.Сертификаты.НаборЗаписей");
	#Если НЕ МобильноеПриложениеСервер Тогда
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	#КонецЕсли
	ЭлементБлокировки.УстановитьЗначение("Регистратор", Отбор.Регистратор.Значение);
	Блокировка.Заблокировать();
	
	Если НЕ СтруктураВременныеТаблицы.Свойство("ДвиженияСертификатыИзменение") ИЛИ
		СтруктураВременныеТаблицы.Свойство("ДвиженияСертификатыИзменение") И НЕ СтруктураВременныеТаблицы.ДвиженияПартииТоваровИзменение Тогда
		
		// Если временная таблица "ДвиженияСертификатыИзменение" не существует или не содержит записей
		// об изменении набора, значит набор записывается первый раз или для набора был выполнен контроль остатков.
		// Текущее состояние набора помещается во временную таблицу "ДвиженияСертификатыПередЗаписью",
		// чтобы при записи получить изменение нового набора относительно текущего.

		Запрос = Новый Запрос(
		"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
		|	Сертификаты.НомерСтроки КАК НомерСтроки,
		|	Сертификаты.Сертификат КАК Сертификат,
		|	Сертификаты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	Сертификаты.СерийныйНомер КАК СерийныйНомер,
		|	ВЫБОР
		|		КОГДА Сертификаты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА Сертификаты.Сумма
		|		ИНАЧЕ -Сертификаты.Сумма
		|	КОНЕЦ КАК СуммаПередЗаписью,
		|	ВЫБОР
		|		КОГДА Сертификаты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА Сертификаты.Количество
		|		ИНАЧЕ -Сертификаты.Количество
		|	КОНЕЦ КАК КоличествоПередЗаписью
		|ПОМЕСТИТЬ ДвиженияСертификатыПередЗаписью
		|ИЗ
		|	РегистрНакопления.Сертификаты КАК Сертификаты
		|ГДЕ
		|	Сертификаты.Регистратор = &Регистратор
		|	И &Замещение");
		
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("Замещение", Замещение);
				
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();

	Иначе 
			
		// Если временная таблица "ДвиженияСертификатыИзменение" существует и содержит записи
		// об изменении набора, значит набор записывается не первый раз и для набора не был выполнен контроль остатков.
		// Текущее состояние набора и текущее состояние изменений помещаются
		// во временную таблцу "ДвиженияСертификатыПередЗаписью",
		// чтобы при записи получить изменение нового набора относительно первоначального.
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
		|	ДвиженияСертификатыИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияСертификатыИзменение.Сертификат КАК Сертификат,
		|	ДвиженияСертификатыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ДвиженияСертификатыИзменение.СерийныйНомер КАК СерийныйНомер,
		|	ДвиженияСертификатыИзменение.КоличествоПередЗаписью КАК КоличествоПередЗаписью,
		|	ДвиженияСертификатыИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью
		|ПОМЕСТИТЬ ДвиженияСертификатыПередЗаписью
		|ИЗ
		|	ДвиженияСертификатыИзменение КАК ДвиженияСертификатыИзменение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Сертификаты.НомерСтроки,
		|	Сертификаты.Сертификат,
		|	Сертификаты.СтруктурнаяЕдиница,
		|	Сертификаты.СерийныйНомер,
		|	ВЫБОР
		|		КОГДА Сертификаты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА Сертификаты.Сумма
		|		ИНАЧЕ -Сертификаты.Сумма
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Сертификаты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА Сертификаты.Количество
		|		ИНАЧЕ -Сертификаты.Количество
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.Сертификаты КАК Сертификаты
		|ГДЕ
		|	Сертификаты.Регистратор = &Регистратор
		|	И &Замещение");
		
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("Замещение", Замещение);
				
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
	КонецЕсли;
	
	// Временная таблица "ДвиженияПартииТоваровИзменение" уничтожается
	// Удаляется информация о ее существовании.
	
	Если СтруктураВременныеТаблицы.Свойство("ДвиженияСертификатыИзменение") Тогда
		
		Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияСертификатыИзменение");
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		СтруктураВременныеТаблицы.Удалить("ДвиженияСертификатыИзменение");
	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
// Процедура - обработчик события ПриЗаписи набора записей.
//
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу "ДвиженияСертификатыИзменение".
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ДвиженияСертификатыИзменение.НомерСтроки) КАК НомерСтроки,
	|	ДвиженияСертификатыИзменение.Сертификат КАК Сертификат,
	|	ДвиженияСертификатыИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ДвиженияСертификатыИзменение.СерийныйНомер КАК СерийныйНомер,
	|	СУММА(ДвиженияСертификатыИзменение.КоличествоПередЗаписью) КАК КоличествоПередЗаписью,
	|	СУММА(ДвиженияСертификатыИзменение.КоличествоИзменение) КАК КоличествоИзменение,
	|	СУММА(ДвиженияСертификатыИзменение.КоличествоПриЗаписи) КАК КоличествоПриЗаписи,
	|	СУММА(ДвиженияСертификатыИзменение.СуммаПередЗаписью) КАК СуммаПередЗаписью,
	|	СУММА(ДвиженияСертификатыИзменение.СуммаИзменение) КАК СуммаИзменение,
	|	СУММА(ДвиженияСертификатыИзменение.СуммаПриЗаписи) КАК СуммаПриЗаписи
	|ПОМЕСТИТЬ ДвиженияСертификатыИзменение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДвиженияСертификатыПередЗаписью.НомерСтроки КАК НомерСтроки,
	|		ДвиженияСертификатыПередЗаписью.Сертификат КАК Сертификат,
	|		ДвиженияСертификатыПередЗаписью.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ДвиженияСертификатыПередЗаписью.СерийныйНомер КАК СерийныйНомер,
	|		ДвиженияСертификатыПередЗаписью.КоличествоПередЗаписью КАК КоличествоПередЗаписью,
	|		ДвиженияСертификатыПередЗаписью.КоличествоПередЗаписью КАК КоличествоИзменение,
	|		0 КАК КоличествоПриЗаписи,
	|		ДвиженияСертификатыПередЗаписью.СуммаПередЗаписью КАК СуммаПередЗаписью,
	|		ДвиженияСертификатыПередЗаписью.СуммаПередЗаписью КАК СуммаИзменение,
	|		0 КАК СуммаПриЗаписи
	|	ИЗ
	|		ДвиженияСертификатыПередЗаписью КАК ДвиженияСертификатыПередЗаписью
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияСертификатыПриЗаписи.НомерСтроки,
	|		ДвиженияСертификатыПриЗаписи.Сертификат,
	|		ДвиженияСертификатыПриЗаписи.СтруктурнаяЕдиница,
	|		ДвиженияСертификатыПриЗаписи.СерийныйНомер,
	|		0,
	|		ВЫБОР
	|			КОГДА ДвиженияСертификатыПриЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ДвиженияСертификатыПриЗаписи.Количество
	|			ИНАЧЕ ДвиженияСертификатыПриЗаписи.Количество
	|		КОНЕЦ,
	|		ДвиженияСертификатыПриЗаписи.Количество,
	|		0,
	|		ВЫБОР
	|			КОГДА ДвиженияСертификатыПриЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ДвиженияСертификатыПриЗаписи.Сумма
	|			ИНАЧЕ ДвиженияСертификатыПриЗаписи.Сумма
	|		КОНЕЦ,
	|		ДвиженияСертификатыПриЗаписи.Сумма
	|	ИЗ
	|		РегистрНакопления.Сертификаты КАК ДвиженияСертификатыПриЗаписи
	|	ГДЕ
	|		ДвиженияСертификатыПриЗаписи.Регистратор = &Регистратор) КАК ДвиженияСертификатыИзменение
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияСертификатыИзменение.Сертификат,
	|	ДвиженияСертификатыИзменение.СтруктурнаяЕдиница,
	|	ДвиженияСертификатыИзменение.СерийныйНомер
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ДвиженияСертификатыИзменение.КоличествоИзменение) <> 0
	|		ИЛИ СУММА(ДвиженияСертификатыИзменение.СуммаИзменение) <> 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сертификат,
	|	СтруктурнаяЕдиница,
	|	СерийныйНомер");
	
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
	ВыборкаИзРезультатаЗапроса.Следующий();
	
	// Новые изменения были помещены во временную таблицу "ДвиженияСертификатыИзменение".
	// Добавляется информация о ее существовании и наличии в ней записей об изменении.
	СтруктураВременныеТаблицы.Вставить("ДвиженияСертификатыИзменение", ВыборкаИзРезультатаЗапроса.Количество > 0);
	
	// Временная таблица "ДвиженияСертификатыПередЗаписью" уничтожается
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияСертификатыПередЗаписью");
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
	
КонецПроцедуры

#КонецОбласти
